import 'package:circular_chart_flutter/circular_chart_flutter.dart';
import 'package:flutter/material.dart';

///
/// 전형 데이터
///
class Estimation {
  // 전형
  List<String> estimations = [
    "논술", "학생부우수자", "지역균형", "농어촌(교과)", "가천의약학",
    "가천바람개비", "가천AI/SW", "농어촌(종합)", "특성화고교", "교육기회균형",
    "특성화고졸재직자", "실기우수자", "조기취업형계약학과"
  ];
  late int index;
  void setIndex(String name) {
    index = estimations.indexOf(name);
  }

  // 전형별 평가하는 요소의 비율
  static List<List<Map<String,double>>> rates = [
    [{"논술": 80, "학생부교과": 20}],
    [{"기타": 100}],
    [{"기타": 100}],
    [{"기타": 100}],
    [{"기타": 100}],
    [{"서류": 100}, {"1단계": 50, "면접": 50}],
    [{"기타": 100}],
    [{"기타": 100}],
    [{"기타": 100}],
    [{"기타": 100}],
    [{"기타": 100}],
    [{"기타": 100}],
    [{"기타": 100}],
    [{"기타": 100}]
  ];
  List<Color> C = [Color(0xFF97F8FF), Color(0xFFA5B1FF)];
  List<List<CircularSegmentEntry>> getChartData() {
    List<List<CircularSegmentEntry>> ret = [];
    rates[index].forEach((e) {
      int idx = 0;
      List<CircularSegmentEntry> temp = [];
      e.forEach((String key, double value) => temp.add(
          CircularSegmentEntry(value, C[idx++], rankKey: "Q${idx}")));
      ret.add(temp);
    });
    return ret;
  }

  // 전형별 학과마다 입학할 수 있는 인원
  static Map<String, List<int>> recruit_data = {
    "경영학부": [91, 46, 25, 2, 0, 50, 0, 3, 5, 0, 90, 0, 0],
    "빅데이터경영학과": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    "금융수학과": [14, 6, 6, 2, 0, 6, 0, 1, 0, 0, 0, 0, 0],
    "미디어커뮤니케이션학과": [13, 7, 6, 2, 0, 11, 0, 2, 2, 0, 0, 0, 0],
    "관광경영학과": [11, 6, 6, 2, 0, 8, 0, 1, 2, 0, 0, 0, 0],
    "경제학과": [26, 10, 8, 2, 0, 15, 0, 2, 2, 0, 0, 0, 0],
    "의료산업경영학과": [13, 6, 6, 2, 0, 6, 0, 0, 2, 0, 0, 0, 0],
    "응용통계학과": [13, 6, 6, 2, 0, 7, 0, 1, 0, 0, 0, 0, 0],
    "사회복지학과": [11, 6, 6, 2, 0, 9, 0, 1, 2, 0, 0, 0, 0],
    "유아교육학과": [15, 6, 6, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0],
    "심리학과": [10, 6, 6, 2, 0, 8, 0, 2, 0, 0, 0, 0, 0],
    "패션산업학과": [8, 6, 5, 2, 0, 6, 0, 2, 3, 0, 0, 0, 0],
    "한국어문학과": [11, 6, 6, 2, 0, 8, 0, 1, 0, 0, 0, 0, 0],
    "외국어계열": [61, 25, 24, 6, 0, 30, 0, 4, 0, 0, 0, 0, 0],
    "법학과": [22, 9, 9, 3, 0, 11, 0, 2, 0, 0, 0, 0, 0],
    "경찰행정학과": [10, 6, 6, 2, 0, 9, 0, 2, 0, 0, 0, 0, 0],
    "행정학과": [10, 6, 7, 2, 0, 7, 0, 1, 2, 0, 0, 0, 0],
    "자유전공학부": [20, 11, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    "도시계획조경학부": [20, 10, 7, 0, 0, 7, 0, 2, 1, 0, 0, 0, 0],
    "건축학부": [30, 14, 10, 3, 0, 11, 0, 2, 3, 0, 0, 0, 0],
    "설비/소방공학과": [18, 10, 7, 2, 0, 8, 0, 1, 2, 0, 0, 0, 0],
    "화공생명공학전공": [23, 13, 8, 2, 0, 16, 0, 2, 2, 0, 0, 0, 0],
    "베터리공학전공": [11, 7, 6, 0, 0, 6, 0, 0, 2, 0, 0, 0, 0],
    "기계공학전공": [21, 12, 8, 2, 0, 16, 0, 2, 3, 0, 0, 0, 0],
    "산업공학전공": [12, 7, 5, 2, 0, 6, 0, 0, 2, 0, 0, 0, 0],
    "스마트팩토리전공": [12, 7, 5, 0, 0, 6, 0, 0, 0, 0, 0, 0, 0],
    "토목환경공학과": [13, 7, 5, 0, 0, 6, 0, 0, 2, 0, 0, 0, 0],
    "신소재공학과": [13, 7, 5, 2, 0, 6, 0, 2, 2, 0, 0, 0, 0],
    "식품생명공학과": [14, 7, 5, 2, 0, 6, 0, 0, 2, 0, 0, 0, 0],
    "식품영양학과": [13, 7, 6, 2, 0, 6, 0, 2, 2, 0, 0, 0, 0],
    "바이오나노학과": [13, 7, 6, 2, 0, 6, 0, 0, 0, 0, 0, 0, 0],
    "생명과학과": [13, 6, 6, 2, 0, 6, 0, 1, 0, 0, 0, 0, 0],
    "물리학과": [12, 6, 6, 2, 0, 7, 0, 0, 0, 0, 0, 0, 0],
    "화학과": [12, 6, 6, 2, 0, 7, 0, 2, 0, 0, 0, 0, 0],
    "소프트웨어전공": [21, 13, 8, 2, 0, 0, 20, 1, 0, 0, 0, 0, 0],
    "인공지능전공": [35, 16, 15, 2, 0, 0, 30, 2, 0, 0, 0, 0, 0],
    "컴퓨터공학전공": [35, 18, 15, 2, 0, 22, 0, 2, 5, 0, 90, 0, 0],
    "스마트보안전공": [13, 6, 6, 2, 0, 6, 0, 0, 0, 0, 0, 0, 0],
    "전자공학과": [30, 16, 13, 2, 0, 18, 0, 2, 3, 0, 0, 0, 0],
    "시스템반도체전공": [12, 6, 6, 2, 0, 6, 0, 0, 0, 0, 0, 0, 0],
    "차세대반도체설계전공": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    "전기공학과": [22, 9, 7, 2, 0, 10, 0, 2, 3, 0, 0, 0, 0],
    "스마트시티융합학과": [12, 6, 5, 2, 0, 6, 0, 0, 0, 0, 0, 0, 0],
    "의공학과": [12, 6, 5, 2, 0, 6, 0, 1, 0, 0, 0, 0, 0],
    "간호학과": [83, 42, 20, 3, 0, 45, 0, 2, 2, 0, 0, 0, 0],
    "바이오로직스학과": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    "치위생학과": [9, 5, 5, 2, 0, 6, 0, 1, 0, 0, 0, 0, 0],
    "방사선학과": [10, 5, 5, 2, 0, 6, 0, 1, 0, 0, 0, 0, 0],
    "물리치료학과": [10, 5, 5, 2, 0, 6, 0, 1, 0, 0, 0, 0, 0],
    "응급구조학과": [6, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0],
    "운동재활학과": [10, 5, 5, 2, 0, 6, 0, 0, 0, 0, 0, 0, 0],
    "의예과": [0, 5, 0, 1, 20, 0, 0, 0, 0, 0, 0, 0, 0],
    "한의예과": [0, 5, 0, 1, 10, 0, 0, 0, 0, 0, 0, 0, 0],
    "약학과": [0, 3, 0, 1, 12, 0, 0, 0, 0, 3, 0, 0, 0],
    "회화/조소전공": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 0],
    "디자인전공": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 0],
    "성악전공": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0],
    "기악전공": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 31, 0],
    "작곡전공": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0],
    "체육전공": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 0],
    "태권도전공": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 0],
    "연기예술학과": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 24, 0],
    "바이오의료기기학과": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40],
    "게임영상학과": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 60],
    "미래자동차학과": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40],
    "반도체디스플레이학과": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50],
    "반도체설계학과": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50]
  };
  List<Widget> getAffi() {
    List<Widget> ret = [];
    recruit_data.forEach((String key, List<int> value) {
      if (value[index] > 0) {
        ret.add(Row(
          mainAxisSize: MainAxisSize.max,
          mainAxisAlignment: MainAxisAlignment.spaceEvenly,
          children: [Text(key), Text(value[index].toString())]
        ));
      }
    });
    return ret;
  }

  // 전형별 비용
  static List<int> cost = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130];
  int getCost() {
    return cost[index];
  }

  // 전형별 제출 서류
}
